---
kind: other
id: Properties.T:Autodesk.Revit.DB.Mechanical.FlexDuctType
source: html/13a0cb2e-28f7-dca1-9646-cbcd092523c5.htm
---
# FlexDuctType Properties

The id of the assembly instance to which the element belongs.